        IDENTIFICATION DIVISION.                                         
        PROGRAM-ID. B14PGM1.                                             
        AUTHOR. VENKAT SINCE2010 +91-7997745085.                         
        DATA DIVISION.                                                   
        WORKING-STORAGE SECTION.                                         
        01 WS-DATA.                                                      
          05 WS-STMT    PIC X(40) VALUE 'WELCOME TO CICS PROGRAM!!!'.    
        PROCEDURE DIVISION.                                              
             PERFORM 1000-SEND-PARA.                                    
              EXEC CICS RETURN END-EXEC.                                 
        1000-SEND-PARA.                                                  
              EXEC CICS SEND                                             
                  FROM(WS-STMT)                                         
                   LENGTH(-6)                                            
                   ERASE                                                 
              END-EXEC.                                                  
